In [1]:
import pandas as pd
import numpy as np

In [17]:
df = pd.DataFrame({'k1': ['a','b','a','a','b'], 
                   'k2': 'one two one two one'.split(),
                   'data1': np.random.randn(5),
                   'data2': np.random.randn(5)})

In [18]:
df

  k1   k2     data1     data2
0  a  one  1.136041  0.254628
1  b  two  0.176238 -0.180664
2  a  one  0.310382  0.168958
3  a  two  0.568548  0.545622
4  b  one  0.236271 -0.171768

In [19]:
grouped = df['data1'].groupby(df['k1'])

grouped

In [20]:
grouped.mean()

k1
a    0.671657
b    0.206254
Name: data1, dtype: float64

In [21]:
means = df['data1'].groupby([df['k1'], df['k2']]).mean()

In [22]:
means

k1  k2
a   one    0.723212
    two    0.568548
b   one    0.236271
    two    0.176238
Name: data1, dtype: float64

In [23]:
means.unstack()

k2       one       two
k1
a   0.723212  0.568548
b   0.236271  0.176238

In [24]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])

In [26]:
df['data1'].groupby([states, years]).mean()

California  2005    0.176238
            2006    0.310382
Ohio        2005    0.852295
            2006    0.236271
Name: data1, dtype: float64

In [30]:
df.groupby('k1')[['data1', 'data2']].mean()

       data1     data2
k1
a   0.671657  0.323069
b   0.206254 -0.176216

In [32]:
df.groupby(['k1', 'k2']).mean()

           data1     data2
k1 k2
a  one  0.723212  0.211793
   two  0.568548  0.545622
b  one  0.236271 -0.171768
   two  0.176238 -0.180664

## Size: returns a Series containing the size of the groups

In [35]:
df.groupby(['k1', 'k2']).size()

k1  k2
a   one    2
    two    1
b   one    1
    two    1
dtype: int64

In [36]:
df.groupby(['k1']).size()

k1
a    3
b    2
dtype: int64